Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.1.203/PIC32CM-JH00/include/component/oscctrl.h
#define OSCCTRL_OSC48MCTRL_ENABLE_Pos         _UINT8_(1)                                           /* (OSCCTRL_OSC48MCTRL) Oscillator Enable Position */
#define OSCCTRL_OSC48MCTRL_ENABLE_Msk         (_UINT8_(0x1) << OSCCTRL_OSC48MCTRL_ENABLE_Pos)      /* (OSCCTRL_OSC48MCTRL) Oscillator Enable Mask */
#define OSCCTRL_OSC48MCTRL_ENABLE(value)      (OSCCTRL_OSC48MCTRL_ENABLE_Msk & (_UINT8_(value) << OSCCTRL_OSC48MCTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the OSCCTRL_OSC48MCTRL register */
#define OSCCTRL_OSC48MCTRL_RUNSTDBY_Pos       _UINT8_(6)                                           /* (OSCCTRL_OSC48MCTRL) Run in Standby Position */
#define OSCCTRL_OSC48MCTRL_RUNSTDBY_Msk       (_UINT8_(0x1) << OSCCTRL_OSC48MCTRL_RUNSTDBY_Pos)    /* (OSCCTRL_OSC48MCTRL) Run in Standby Mask */
#define OSCCTRL_OSC48MCTRL_RUNSTDBY(value)    (OSCCTRL_OSC48MCTRL_RUNSTDBY_Msk & (_UINT8_(value) << OSCCTRL_OSC48MCTRL_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the OSCCTRL_OSC48MCTRL register */
#define OSCCTRL_OSC48MCTRL_ONDEMAND_Pos       _UINT8_(7)                                           /* (OSCCTRL_OSC48MCTRL) On Demand Control Position */
#define OSCCTRL_OSC48MCTRL_ONDEMAND_Msk       (_UINT8_(0x1) << OSCCTRL_OSC48MCTRL_ONDEMAND_Pos)    /* (OSCCTRL_OSC48MCTRL) On Demand Control Mask */
#define OSCCTRL_OSC48MCTRL_ONDEMAND(value)    (OSCCTRL_OSC48MCTRL_ONDEMAND_Msk & (_UINT8_(value) << OSCCTRL_OSC48MCTRL_ONDEMAND_Pos)) /* Assigment of value for ONDEMAND in the OSCCTRL_OSC48MCTRL register */
#define OSCCTRL_OSC48MCTRL_Msk                _UINT8_(0xC2)                                        /* (OSCCTRL_OSC48MCTRL) Register Mask  */


/* -------- OSCCTRL_OSC48MDIV : (OSCCTRL Offset: 0x15) (R/W 8) OSC48M Divider -------- */
#define OSCCTRL_OSC48MDIV_RESETVALUE          _UINT8_(0x0B)                                        /*  (OSCCTRL_OSC48MDIV) OSC48M Divider  Reset Value */

#define OSCCTRL_OSC48MDIV_DIV_Pos             _UINT8_(0)                                           /* (OSCCTRL_OSC48MDIV) OSC48M Division Factor Position */
#define OSCCTRL_OSC48MDIV_DIV_Msk             (_UINT8_(0xF) << OSCCTRL_OSC48MDIV_DIV_Pos)          /* (OSCCTRL_OSC48MDIV) OSC48M Division Factor Mask */
#define OSCCTRL_OSC48MDIV_DIV(value)          (OSCCTRL_OSC48MDIV_DIV_Msk & (_UINT8_(value) << OSCCTRL_OSC48MDIV_DIV_Pos)) /* Assigment of value for DIV in the OSCCTRL_OSC48MDIV register */
#define   OSCCTRL_OSC48MDIV_DIV_DIV1_Val      _UINT8_(0x0)                                         /* (OSCCTRL_OSC48MDIV) 48 MHz  */
#define   OSCCTRL_OSC48MDIV_DIV_DIV2_Val      _UINT8_(0x1)                                         /* (OSCCTRL_OSC48MDIV) 24 MHz  */
#define   OSCCTRL_OSC48MDIV_DIV_DIV3_Val      _UINT8_(0x2)                                         /* (OSCCTRL_OSC48MDIV) 16 MHz  */
#define   OSCCTRL_OSC48MDIV_DIV_DIV4_Val      _UINT8_(0x3)                                         /* (OSCCTRL_OSC48MDIV) 12 MHz  */
#define   OSCCTRL_OSC48MDIV_DIV_DIV5_Val      _UINT8_(0x4)                                         /* (OSCCTRL_OSC48MDIV) 9.6 MHz  */
#define   OSCCTRL_OSC48MDIV_DIV_DIV6_Val      _UINT8_(0x5)                                         /* (OSCCTRL_OSC48MDIV) 8 MHz  */
#define   OSCCTRL_OSC48MDIV_DIV_DIV7_Val      _UINT8_(0x6)                                         /* (OSCCTRL_OSC48MDIV) 6.86 MHz  */
#define   OSCCTRL_OSC48MDIV_DIV_DIV8_Val      _UINT8_(0x7)                                         /* (OSCCTRL_OSC48MDIV) 6 MHz  */
#define   OSCCTRL_OSC48MDIV_DIV_DIV9_Val      _UINT8_(0x8)                                         /* (OSCCTRL_OSC48MDIV) 5.33 MHz  */
#define   OSCCTRL_OSC48MDIV_DIV_DIV10_Val     _UINT8_(0x9)                                         /* (OSCCTRL_OSC48MDIV) 4.8 MHz  */
#define   OSCCTRL_OSC48MDIV_DIV_DIV11_Val     _UINT8_(0xA)                                         /* (OSCCTRL_OSC48MDIV) 4.36 MHz  */
#define   OSCCTRL_OSC48MDIV_DIV_DIV12_Val     _UINT8_(0xB)                                         /* (OSCCTRL_OSC48MDIV) 4 MHz  */
#define   OSCCTRL_OSC48MDIV_DIV_DIV13_Val     _UINT8_(0xC)                                         /* (OSCCTRL_OSC48MDIV) 3.69 MHz  */
#define   OSCCTRL_OSC48MDIV_DIV_DIV14_Val     _UINT8_(0xD)                                         /* (OSCCTRL_OSC48MDIV) 3.43 MHz  */
#define   OSCCTRL_OSC48MDIV_DIV_DIV15_Val     _UINT8_(0xE)                                         /* (OSCCTRL_OSC48MDIV) 3.2 MHz  */
#define   OSCCTRL_OSC48MDIV_DIV_DIV16_Val     _UINT8_(0xF)                                         /* (OSCCTRL_OSC48MDIV) 3 MHz  */
#define OSCCTRL_OSC48MDIV_DIV_DIV1            (OSCCTRL_OSC48MDIV_DIV_DIV1_Val << OSCCTRL_OSC48MDIV_DIV_Pos) /* (OSCCTRL_OSC48MDIV) 48 MHz Position  */
#define OSCCTRL_OSC48MDIV_DIV_DIV2            (OSCCTRL_OSC48MDIV_DIV_DIV2_Val << OSCCTRL_OSC48MDIV_DIV_Pos) /* (OSCCTRL_OSC48MDIV) 24 MHz Position  */
#define OSCCTRL_OSC48MDIV_DIV_DIV3            (OSCCTRL_OSC48MDIV_DIV_DIV3_Val << OSCCTRL_OSC48MDIV_DIV_Pos) /* (OSCCTRL_OSC48MDIV) 16 MHz Position  */
#define OSCCTRL_OSC48MDIV_DIV_DIV4            (OSCCTRL_OSC48MDIV_DIV_DIV4_Val << OSCCTRL_OSC48MDIV_DIV_Pos) /* (OSCCTRL_OSC48MDIV) 12 MHz Position  */
#define OSCCTRL_OSC48MDIV_DIV_DIV5            (OSCCTRL_OSC48MDIV_DIV_DIV5_Val << OSCCTRL_OSC48MDIV_DIV_Pos) /* (OSCCTRL_OSC48MDIV) 9.6 MHz Position  */
#define OSCCTRL_OSC48MDIV_DIV_DIV6            (OSCCTRL_OSC48MDIV_DIV_DIV6_Val << OSCCTRL_OSC48MDIV_DIV_Pos) /* (OSCCTRL_OSC48MDIV) 8 MHz Position  */
#define OSCCTRL_OSC48MDIV_DIV_DIV7            (OSCCTRL_OSC48MDIV_DIV_DIV7_Val << OSCCTRL_OSC48MDIV_DIV_Pos) /* (OSCCTRL_OSC48MDIV) 6.86 MHz Position  */
#define OSCCTRL_OSC48MDIV_DIV_DIV8            (OSCCTRL_OSC48MDIV_DIV_DIV8_Val << OSCCTRL_OSC48MDIV_DIV_Pos) /* (OSCCTRL_OSC48MDIV) 6 MHz Position  */
#define OSCCTRL_OSC48MDIV_DIV_DIV9            (OSCCTRL_OSC48MDIV_DIV_DIV9_Val << OSCCTRL_OSC48MDIV_DIV_Pos) /* (OSCCTRL_OSC48MDIV) 5.33 MHz Position  */
#define OSCCTRL_OSC48MDIV_DIV_DIV10           (OSCCTRL_OSC48MDIV_DIV_DIV10_Val << OSCCTRL_OSC48MDIV_DIV_Pos) /* (OSCCTRL_OSC48MDIV) 4.8 MHz Position  */
#define OSCCTRL_OSC48MDIV_DIV_DIV11           (OSCCTRL_OSC48MDIV_DIV_DIV11_Val << OSCCTRL_OSC48MDIV_DIV_Pos) /* (OSCCTRL_OSC48MDIV) 4.36 MHz Position  */
#define OSCCTRL_OSC48MDIV_DIV_DIV12           (OSCCTRL_OSC48MDIV_DIV_DIV12_Val << OSCCTRL_OSC48MDIV_DIV_Pos) /* (OSCCTRL_OSC48MDIV) 4 MHz Position  */
#define OSCCTRL_OSC48MDIV_DIV_DIV13           (OSCCTRL_OSC48MDIV_DIV_DIV13_Val << OSCCTRL_OSC48MDIV_DIV_Pos) /* (OSCCTRL_OSC48MDIV) 3.69 MHz Position  */
#define OSCCTRL_OSC48MDIV_DIV_DIV14           (OSCCTRL_OSC48MDIV_DIV_DIV14_Val << OSCCTRL_OSC48MDIV_DIV_Pos) /* (OSCCTRL_OSC48MDIV) 3.43 MHz Position  */
#define OSCCTRL_OSC48MDIV_DIV_DIV15           (OSCCTRL_OSC48MDIV_DIV_DIV15_Val << OSCCTRL_OSC48MDIV_DIV_Pos) /* (OSCCTRL_OSC48MDIV) 3.2 MHz Position  */
#define OSCCTRL_OSC48MDIV_DIV_DIV16           (OSCCTRL_OSC48MDIV_DIV_DIV16_Val << OSCCTRL_OSC48MDIV_DIV_Pos) /* (OSCCTRL_OSC48MDIV) 3 MHz Position  */
#define OSCCTRL_OSC48MDIV_Msk                 _UINT8_(0x0F)                                        /* (OSCCTRL_OSC48MDIV) Register Mask  */


/* -------- OSCCTRL_OSC48MSTUP : (OSCCTRL Offset: 0x16) (R/W 8) OSC48M Startup Time -------- */
#define OSCCTRL_OSC48MSTUP_RESETVALUE         _UINT8_(0x07)                                        /*  (OSCCTRL_OSC48MSTUP) OSC48M Startup Time  Reset Value */

#define OSCCTRL_OSC48MSTUP_STARTUP_Pos        _UINT8_(0)                                           /* (OSCCTRL_OSC48MSTUP) Startup Time Position */
#define OSCCTRL_OSC48MSTUP_STARTUP_Msk        (_UINT8_(0x7) << OSCCTRL_OSC48MSTUP_STARTUP_Pos)     /* (OSCCTRL_OSC48MSTUP) Startup Time Mask */
#define OSCCTRL_OSC48MSTUP_STARTUP(value)     (OSCCTRL_OSC48MSTUP_STARTUP_Msk & (_UINT8_(value) << OSCCTRL_OSC48MSTUP_STARTUP_Pos)) /* Assigment of value for STARTUP in the OSCCTRL_OSC48MSTUP register */
#define   OSCCTRL_OSC48MSTUP_STARTUP_CYCLE8_Val _UINT8_(0x0)                                         /* (OSCCTRL_OSC48MSTUP) 166 ns  */
#define   OSCCTRL_OSC48MSTUP_STARTUP_CYCLE16_Val _UINT8_(0x1)                                         /* (OSCCTRL_OSC48MSTUP) 333 ns  */
#define   OSCCTRL_OSC48MSTUP_STARTUP_CYCLE32_Val _UINT8_(0x2)                                         /* (OSCCTRL_OSC48MSTUP) 667 ns  */
#define   OSCCTRL_OSC48MSTUP_STARTUP_CYCLE64_Val _UINT8_(0x3)                                         /* (OSCCTRL_OSC48MSTUP) 1.333 us  */
#define   OSCCTRL_OSC48MSTUP_STARTUP_CYCLE128_Val _UINT8_(0x4)                                         /* (OSCCTRL_OSC48MSTUP) 2.667 us  */
#define   OSCCTRL_OSC48MSTUP_STARTUP_CYCLE256_Val _UINT8_(0x5)                                         /* (OSCCTRL_OSC48MSTUP) 5.333 us  */
#define   OSCCTRL_OSC48MSTUP_STARTUP_CYCLE512_Val _UINT8_(0x6)                                         /* (OSCCTRL_OSC48MSTUP) 10.667 us  */
#define   OSCCTRL_OSC48MSTUP_STARTUP_CYCLE1024_Val _UINT8_(0x7)                                         /* (OSCCTRL_OSC48MSTUP) 21.333 us  */
#define OSCCTRL_OSC48MSTUP_STARTUP_CYCLE8     (OSCCTRL_OSC48MSTUP_STARTUP_CYCLE8_Val << OSCCTRL_OSC48MSTUP_STARTUP_Pos) /* (OSCCTRL_OSC48MSTUP) 166 ns Position  */
#define OSCCTRL_OSC48MSTUP_STARTUP_CYCLE16    (OSCCTRL_OSC48MSTUP_STARTUP_CYCLE16_Val << OSCCTRL_OSC48MSTUP_STARTUP_Pos) /* (OSCCTRL_OSC48MSTUP) 333 ns Position  */
#define OSCCTRL_OSC48MSTUP_STARTUP_CYCLE32    (OSCCTRL_OSC48MSTUP_STARTUP_CYCLE32_Val << OSCCTRL_OSC48MSTUP_STARTUP_Pos) /* (OSCCTRL_OSC48MSTUP) 667 ns Position  */
#define OSCCTRL_OSC48MSTUP_STARTUP_CYCLE64    (OSCCTRL_OSC48MSTUP_STARTUP_CYCLE64_Val << OSCCTRL_OSC48MSTUP_STARTUP_Pos) /* (OSCCTRL_OSC48MSTUP) 1.333 us Position  */
#define OSCCTRL_OSC48MSTUP_STARTUP_CYCLE128   (OSCCTRL_OSC48MSTUP_STARTUP_CYCLE128_Val << OSCCTRL_OSC48MSTUP_STARTUP_Pos) /* (OSCCTRL_OSC48MSTUP) 2.667 us Position  */
#define OSCCTRL_OSC48MSTUP_STARTUP_CYCLE256   (OSCCTRL_OSC48MSTUP_STARTUP_CYCLE256_Val << OSCCTRL_OSC48MSTUP_STARTUP_Pos) /* (OSCCTRL_OSC48MSTUP) 5.333 us Position  */
#define OSCCTRL_OSC48MSTUP_STARTUP_CYCLE512   (OSCCTRL_OSC48MSTUP_STARTUP_CYCLE512_Val << OSCCTRL_OSC48MSTUP_STARTUP_Pos) /* (OSCCTRL_OSC48MSTUP) 10.667 us Position  */
#define OSCCTRL_OSC48MSTUP_STARTUP_CYCLE1024  (OSCCTRL_OSC48MSTUP_STARTUP_CYCLE1024_Val << OSCCTRL_OSC48MSTUP_STARTUP_Pos) /* (OSCCTRL_OSC48MSTUP) 21.333 us Position  */
#define OSCCTRL_OSC48MSTUP_Msk                _UINT8_(0x07)                                        /* (OSCCTRL_OSC48MSTUP) Register Mask  */


/* -------- OSCCTRL_OSC48MSYNCBUSY : (OSCCTRL Offset: 0x18) ( R/ 32) OSC48M Synchronization Busy -------- */
#define OSCCTRL_OSC48MSYNCBUSY_RESETVALUE     _UINT32_(0x00)                                       /*  (OSCCTRL_OSC48MSYNCBUSY) OSC48M Synchronization Busy  Reset Value */

